app/views/turmas/_form.html.erb

SELECT `disciplinas`.* FROM `disciplinas`
---
    <%= f.label :disciplina_id %><br />
    <%= f.collection_select(:disciplina_id, Disciplina.all, :id, :nome) %>

SELECT `professors`.* FROM `professors`
---
    <%= f.label :professor_id %><br />
    <%= f.collection_select(:professor_id, Professor.all, :id, :nome) %>