app/controllers/alunos_controller.rb

SELECT `alunos`.* FROM `alunos`
---
  def index
    @alunos = Aluno.all

SELECT `alunos`.* FROM `alunos` WHERE `alunos`.`id` = 1 LIMIT 1
---
  def show
    @aluno = Aluno.find(params[:id])

INSERT INTO `alunos` (`created_at`, `email`, `matricula`, `nome`, `updated_at`) VALUES ('2012-06-09 03:04:22', '1@1.com', '1', 'Aluno 1', '2012-06-09 03:04:22')
---
  def create
    @aluno = Aluno.new(params[:aluno])

    respond_to do |format|
      if @aluno.save