app/controllers/disciplinas_controller.rb

  def index
    @disciplinas = Disciplina.all
---
SELECT `disciplinas`.* FROM `disciplinas`

  def show
    @disciplina = Disciplina.find(params[:id])
---
SELECT `disciplinas`.* FROM `disciplinas` WHERE `disciplinas`.`id` = 1 LIMIT 1

  def create
    @disciplina = Disciplina.new(params[:disciplina])

    respond_to do |format|
      if @disciplina.save
---
INSERT INTO `disciplinas` (`codigo`, `created_at`, `nome`, `updated_at`) VALUES ('204590', '2012-06-09 00:53:08', 'Inteligência Artificial', '2012-06-09 00:53:08')