app/controllers/notas_controller.rb

  def index
    if params[:turma_id]
      @notas = Turma.find(params[:turma_id]).notas
    elsif params[:aluno_id]
      @notas = Aluno.find(params[:aluno_id]).notas
    else
      @notas = Nota.all
---
SELECT `turmas`.* FROM `turmas` WHERE `turmas`.`id` = 450215437 LIMIT 1
SELECT `alunos`.* FROM `alunos` WHERE `alunos`.`id` = 450215437 LIMIT 1
SELECT `notas`.* FROM `notas`

  def show
    @nota = Nota.find(params[:id])
---
SELECT `notas`.* FROM `notas` WHERE `notas`.`id` = 980190963 LIMIT 1

  def create
    @nota = Nota.new(params[:nota])

    respond_to do |format|
      if @nota.save
---
INSERT INTO `notas` (`aluno_id`, `created_at`, `g1`, `g2`, `g3`, `turma_id`, `updated_at`) VALUES (1, '2012-06-09 04:19:43', 0.0, 0.0, 0.0, 2, '2012-06-09 04:19:43')