app/controllers/professors_controller.rb

SELECT `professors`.* FROM `professors`
---
  def index
    @professors = Professor.all

SELECT `professors`.* FROM `professors` WHERE `professors`.`id` = 1 LIMIT 1
---
  def show
    @professor = Professor.find(params[:id])

SELECT `professors`.* FROM `professors` WHERE `professors`.`id` = 1 LIMIT 1
---
  def edit
    @professor = Professor.find(params[:id])

INSERT INTO `professors` (`cgu`, `created_at`, `nome`, `updated_at`) VALUES ('17889330', '2012-06-09 00:54:21', 'Tales Bitelo Viegas', '2012-06-09 00:54:21')
---
  def create
    @professor = Professor.new(params[:professor])

    respond_to do |format|
      if @professor.save