app/controllers/turmas_controller.rb

SELECT `disciplinas`.* FROM `disciplinas` WHERE `disciplinas`.`id` = 2 LIMIT 1
SELECT `professors`.* FROM `professors` WHERE `professors`.`id` = 1 LIMIT 1
SELECT `turmas`.* FROM `turmas`
---
  def index
    if params[:aluno_id]
      @turmas = Aluno.find(params[:aluno_id]).turmas
    elsif params[:disciplina_id]
      @turmas = Disciplina.find(params[:disciplina_id]).turmas
    elsif params[:professor_id]
      @turmas = Professor.find(params[:professor_id]).turmas
    else
      @turmas = Turma.all

SELECT `turmas`.* FROM `turmas` WHERE `turmas`.`id` = 1 LIMIT 1
---
  def show
    @turma = Turma.find(params[:id])

SELECT `turmas`.* FROM `turmas` WHERE `turmas`.`id` = 1 LIMIT 1
---
  def edit
    @turma = Turma.find(params[:id])

INSERT INTO `turmas` (`codigo`, `created_at`, `creditos`, `disciplina_id`, `professor_id`, `semestre`, `updated_at`) VALUES ('0134-A', '2012-06-09 00:55:00', 4, 1, 2, '2012/1', '2012-06-09 00:55:00')
---
  def create
    @turma = Turma.new(params[:turma])

    respond_to do |format|
      if @turma.save

SELECT `turmas`.* FROM `turmas` WHERE `turmas`.`id` = 1 LIMIT 1
UPDATE `turmas` SET `updated_at` = '2012-06-09 00:55:12', `professor_id` = 1 WHERE `turmas`.`id` = 1
---
  def update
    @turma = Turma.find(params[:id])

    respond_to do |format|
      if @turma.update_attributes(params[:turma])

SELECT `turmas`.* FROM `turmas` WHERE `turmas`.`id` = 2 LIMIT 1
DELETE FROM `turmas` WHERE `turmas`.`id` = 2
---
  def destroy
    @turma = Turma.find(params[:id])
    @turma.destroy