app/views/notas/_form.html.erb

    <%= f.label :turma %><br />
    <%= f.collection_select(:turma_id, Turma.all, :id, :codigo) %>
---
SELECT `turmas`.* FROM `turmas`

    <%= f.label :aluno %><br />
    <%= f.collection_select(:aluno_id, Aluno.all, :id, :nome) %>
---
SELECT `alunos`.* FROM `alunos`